/*
7. Пусть элементами прямоугольного равнобедренного треугольника являются :
1) катет а;
2) гипотенуза b;
3) высота h, опущенная из вершины прямого угла на гипотенузу;
4) площадь S.
Составить программу, которая по заданному номеру и значению соответствующего элемента вычисляла бы значение всех остальных элементов треугольника.
*/
#include <iostream>
#include <Windows.h>;
using namespace std;

int main()
{
	SetConsoleOutputCP(1251);
	long long int n;
	double a, b, h, s, pi = 3.1415926535;
	cout << "Введите номер эл-та (1 - катет a; 2 - гипотенуза b; 3 - высота h; 4 - площадь S): ";
	cin >> n;
	switch (n) {
	case 1:
		cout << "введите катет: "; cin >> n;
		a = n;
		cout << "катет = " << a << ";\n";
		b = sqrt(2.0 * n * n);
		cout << "гипотенуза = " << b << ";\n";
		h = b / 2.0;
		cout << "высота = " << h << ";\n";
		s = n * n / 2.0;
		cout << "площадь = " << s << ";\n" << endl;
		break;
	case 2:
		cout << "введите гипотенузу: "; cin >> n;
		b = n;
		cout << "гипотенуза = " << b << ";\n";
		h = n / 2.0;
		cout << "высота = " << h << ";\n";
		a = n / sin(pi / 4.0);
		cout << "катет = " << a << ";\n";
		s = n * n / 2.0;
		cout << "площадь = " << s << ";\n" << endl;
		break;
	case 3:
		cout << "введите высоту: "; cin >> n;
		h = n;
		cout << "высота = " << h << ";\n";
		b = 2.0 * n;
		cout << "гипотенуза = " << b << ";\n";
		a = n / sin(pi / 4.0);
		cout << "катет = " << a << ";\n";
		s = n * n / 2.0;
		cout << "площадь = " << s << ";\n" << endl;
		break;
	case 4:
		cout << "введите площадь: "; cin >> n;
		s = n;
		cout << "площадь = " << s << ";\n" << endl;
		a = sqrt(2.0 * n);
		cout << "катет = " << a << ";\n";
		b = sqrt(2.0 * a * a);
		cout << "гипотенуза = " << b << ";\n";
		h = b / 2.0;
		cout << "высота = " << h << ";\n";
		break;
	default: cout << "Ошибка";
	}
	return 0;
}
